# from database import local_users
# user = local_users[user_id]
emoji = '🔙🔴🟠🟡🟢🔵🟣🟤💲🔁💱♥️🔔🔜➡️⬅️🔼🔽↕️↔️⬆️⬇️↗️↘️↙️↖️🆓🆕🔢🔡💤✅❗️❓💵💳🔥😁😍🥰😎😱🤗\
📍💧❓🤖🌱💸🏡🪪😱🤑😂😜😁😴✨'


ton = 'TON:\nUQAegScNLWtuhtDlBd2oq5Utjkm_W_NSmWlBvYU83z65uMu7'

# start_guide1_text = "Я бот Уровни 🤖\n<b>Уровни помогают исполнить желания и изменить жизнь ❤️</b>\
#                             \n\nМожно зарабатывать всё больше с каждым уровнем💲\nЛегко и приятно. Прямо с телефона\nТысячи людей уже вышли на новый уровень дохода.\n\nЯ покажу как."
start_guide1_text ='\n\nЯ бот Нивелиша 🤗\nРад видеть тебя в Уровнях!\n\nЯ могу рассказать за 3 минуты как зарабатывать в Уровнях\n\nНо сначала бонус!'
start_guide2_text = "\n\nДальше они будут больше 🔼\n\nМожно получить следующий бонус за 2 простых действия:\n\n1. Подписка на канал"
start_guide3_text_1 = '🎁 Бонус:         +❓рублей' + '\n💳 Баланс:      **** рублей'\
    '\n\nПривет! 🤗\nЯ открываю бонусы в Уровнях 🔥\n\nОткрой, пожалуйста, свой бонус\nчтобы мне получить еще один 😍\n'

start_guide3_text_2 = 'Можно нажать круглую стрелку\nСправа чуть выше ➡️ ↗️\n\nВыбрать с кем поделиться 🤗\n\nИ получить ещё Бонусы 🎁🎁🎁\
    \nЗа каждого, кто придёт по вашей ссылке и откроет два бонуса\n\nНа все вопросы ответы по ссылке\n\nПолучить возможность зарабатывать легко и приятно 😋'

start_guide4_text = "Основная часть бюджета на маркетинг - раздача бонусов 🎁\nРаздавать бонусы приятней, чем закупать рекламу 😍\nА получать бонусы интересней, чем рекламу видеть 😄\nСогласны❓\
    \n\nРазыгрываем бонусы каждый день\n\nЧтобы не пропустить, можно включить всплывающие уведомления в боте\nТри точки ↗️ Уведомления 🔊 Настроить\nВсплывающие уведомления вкл🔘\nПриоритет - срочный)"

start_guide4_text_2 = '\nНа первом уровне есть инструкция и все инструменты чтобы продать уровень сотни раз\nУровень окупается с первой продажи 😊\n\n+ пассивный доход 25% в год\n\nУровни остаются НАВСЕГДА❗️\nИх цена постоянно растёт 🔼\
    \n\nЭто не биткоин...\nУровни как майнинговая ферма с бесконечной энергией 😁'

bonuses_tub_text1 = "Получите Бонус за каждого реферала 🎁\n\nПоделитесь возможностью зарабатывать много легко и приятно 😍\n"

bonuses_tub_text2 = "\n\nКаждый реферал - ваш возможный покупатель Уровней! ❤️❤️❤️'\n\nВсего получено бонусов: "

bonuses_none = "\nЗдесь пока ничего нет\nКуда всё делось? 🤔\n\nБонусы разыгрываются каждый день! \nМы отправим уведомление, когда придет бонус.\
    \n\nРекомендуем включить всплывающие уведомления в настройках бота🔔\n\nНажимайте поделиться\nполучайте бонус за каждого нового подписчика! 🎁"
          


accounts_about_text = '\n\nПодробнее: https://t.me/Levels_info/5' + '\n\nПереводы: https://t.me/Levels_info/39'
# "\n\n      В Levels 3 вида счетов:\n🏡Самый доходный\n2️⃣🌱Рост и ликвидность\n3️⃣💧Самый свободный\n\
#     \n\n1️⃣ Restate - max доходность 💵⏫\nДля перехода на первый уровень\nнужен Restate >= 500 рублей\nВыплата дохода от недвижимости ежедневно на Grow счёт\
#     \nRestate можно продать.\
#     \n\n2️⃣ Переводы на Grow и Restate счета 🔼\nбез ограничений\nВыводы на Liquid 🔽\nс задержкой/комиссией\
#     \n\n3️⃣ Liquid - доходности нет\nВыводы и переводы без комиссий"

requisites_text_1 = '\n\nТинькофф СБП: +7(996)893-15-12\n\n1. Сделать перевод\n2. Сохранить чек\n3. Нажать кнопку Перевод отправлен\n4. Отправить боту чек для ускорения'
requisites_text_2 = '\n\nToncoin:\nUQAegScNLWtuhtDlBd2oq5Utjkm_W_NSmWlBvYU83z65uMu7\n\n1. Добавить +7(996)893-15-12\nв контакты в телеграм\n(для перевода без комиссии)\n2. Сделать перевод\n3. Нажать кнопку Перевод отправлен\n4. Отправить боту чек для ускорения'
requisites_text_3 = '\n\nUSDT TON:\nUQAegScNLWtuhtDlBd2oq5Utjkm_W_NSmWlBvYU83z65uMu7\n\n1. Добавить +7(996)893-15-12\nв контакты в телеграм\n(для перевода без комиссии)\n2. Сделать перевод\n3. Нажать кнопку Перевод отправлен\n4. Отправить боту чек для ускорения'
                                             
resurses_text = '\n🔗 Ресурсы\n\nОфициальный канал:\nhttps://t.me/Levels_up\nКаналы уровней:\nhttps://t.me/Levels_info/6'


learn_text = '\nПро Уровни: '+'https://telegra.ph/UROVNI-04-19'+'\nОсновное: ' + 'https://t.me/Levels_info/37' + '\nПредупреждение о рисках: ' + 'https://t.me/Levels_info/2' + '\nНалоги: ' + 'https://t.me/Levels_info/4' + '\nЦель Уровней: ' + 'https://t.me/Levels_info/34' + '\nПример: ' + 'https://t.me/Levels_info/35'

good_morning_text = '😄 Каждое утро может быть добрым 🥰\nО финансах я позабочусь🤖\n\nRestate: 100 +15 -> 115 \n\n\n\n'

greet = ("{name}, приветствую в Уровнях! \n\n"  
         "Уровни помогают менять жизнь и исполнять желания.\n"
         "Тысячи людей уже вышли на новый уровень дохода.\n" 
         "Я покажу как!  🤗\n\n"
         "Начнем с бонуса  🎁"
         )


